org-literate-devtools.org
#+TITLE: org-literate-devtools
#+AUTHOR: Dmitry Akatov
#+EMAIL: akatovda@yandex.com
#+CATEGORY: org-literate-devtools
#+PROPERTY: header-args:emacs-lisp :noweb yes :tangle yes :results silent

* Hello

#+begin_src emacs-lisp
;;; oldt.el --- org-driven development

;; Copyright (C) 2019 Dmitry Akatov

;; Author: Dmitry Akatov <akatovda@yandex.com>
;; Created: 17 Feb 2019
;; Version: 0.1

;; Keywords: org devtools babel
;; Homepage: https://github.com/rails-to-cosmos/oldt

;; This file is not part of GNU Emacs.

;; This program is free software: you can redistribute it and/or modify
;; it under the terms of the GNU General Public License as published by
;; the Free Software Foundation, either version 3 of the License, or
;; (at your option) any later version.

;; This program is distributed in the hope that it will be useful,
;; but WITHOUT ANY WARRANTY; without even the implied warranty of
;; MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
;; GNU General Public License for more details.

;; You should have received a copy of the GNU General Public License
;; along with this program.  If not, see <http://www.gnu.org/licenses/>.

;;; Commentary:
;; This package allows you to manage bookmarks and travel around the
;; digital world with an org-mode power behind your shoulders.

;;; Code:
#+end_src

* Core
** org-element helpers
*** is-there-tags-at-point

#+begin_src emacs-lisp
(defun is-there-tags-at-point (tags)
  (seq-intersection tags (org-get-tags-at)))
#+end_src

*** get-node-property
#+begin_src emacs-lisp
(defun oldt-get-node-property (property)
  (save-excursion
    (unless (org-at-heading-p)
      (org-back-to-heading))

    (alist-get property (org-entry-properties) nil nil #'string=)))
#+end_src
*** search-ancestor

#+begin_src emacs-lisp
(defun oldt-search-ancestor (predicate)
  (save-excursion
    (org-with-wide-buffer
     (unless (org-at-heading-p)
       (org-back-to-heading))
     (loop-until (or (funcall predicate)
                     (null (org-up-heading-safe))))
     (when (funcall predicate)
       (point-marker)))))
#+end_src

* Features
** Projects
*** menu
#+begin_src emacs-lisp
(defun oldt-project-menu ()
  (interactive)
  (let ((tiny-menu-items
         `(("project-menu"
            (,(oldt-project-get-property "ITEM")
             ((?s "Service" oldt-service-menu)
              (?t "Ticket" oldt-browse-ticket)))))))
    (tiny-menu "project-menu")))
#+end_src
*** tangle-project
#+begin_src emacs-lisp
(defun oldt-tangle-buffer ()
  (org-element-map (org-element-parse-buffer 'element) 'src-block
    (lambda (datum)
      (let* ((lang (org-element-property :language datum))
             (ext (or (cdr (assoc lang org-babel-tangle-lang-exts)) lang))
             (point (org-element-property :begin datum)))
        (org-with-point-at point
          (oldt-tangle-relatives))))))

(defun oldt-tangle-subtree-at-point ()
  (interactive)
  (save-restriction
    (condition-case nil
        (org-narrow-to-subtree)
      (error nil))
    (oldt-tangle-buffer)))

(defun oldt-tangle-project ()
  (interactive)
  (save-excursion
    (oldt-goto-project)
    (oldt-tangle-subtree-at-point)))
#+end_src
*** compile-project
#+begin_src emacs-lisp
(defun oldt-compile-project()
  (interactive)
  (oldt-tangle-project)
  (let ((cmd (oldt-ensure-local-var 'compile-command)))
    (save-excursion
      (oldt-goto-project)
      (save-window-excursion
        (oldt-goto-tangle-file)
        (compile cmd))))

  (switch-to-buffer-other-window "*compilation*"))
#+end_src
*** search-project
#+begin_src emacs-lisp
(defun oldt-search-project ()
  (cond ((org-at-heading-p) t)
        ((org-clocking-p) (org-clock-goto))
        (t nil))
  (oldt-search-ancestor #'(lambda () (plist-get (org-element--get-node-properties) :CATEGORY))))
#+end_src
*** goto-project
#+begin_src emacs-lisp
(defun oldt-goto-project ()
  (interactive)
  (org-goto-marker-or-bmk (oldt-search-project)))
#+end_src
*** project-get-property
#+begin_src emacs-lisp
(defun oldt-project-get-property (property)
  (save-window-excursion
    (save-excursion
      (condition-case nil
          (progn
            (oldt-goto-project)
            (oldt-get-node-property property))
        (error nil)))))
#+end_src
*** COMMENT toggle-explicit-category
#+begin_src emacs-lisp
(defun oldt-toggle-explicit-category ()
  (interactive)
  (save-excursion
    (org-back-to-heading t)
    (let ((case-fold-search nil)
          (explicit-category (format "[%s]" (org-get-category))))

      (when (looking-at org-todo-line-regexp)
        (beginning-of-line)
        (let*
            ((eol (save-excursion
                    (end-of-line)
                    (mark)))
             (category-specified-p (save-excursion
                                     (condition-case nil
                                         (progn
                                           (search-forward explicit-category eol) t)
                                       ('error nil)))))
          (when (not category-specified-p)
            (condition-case nil
                (progn (re-search-forward org-todo-regexp)
                       (insert " "))
              ('error (progn (search-forward "* ")
                             (insert " ")
                             (backward-char))))
            (insert explicit-category)))))))
#+end_src
** Tasks
*** task-hooks
#+begin_src emacs-lisp
(defun oldt-trigger-function (change-plist)
  (let ((state-from (substring-no-properties (or (plist-get change-plist :from) "")))
        (state-to (substring-no-properties (or (plist-get change-plist :to) ""))))
    (when-let (magic-property (oldt-project-get-property (format "TASK_%s" state-to)))
      (eval (read magic-property)))))
(add-hook 'org-trigger-hook 'oldt-trigger-function)
#+end_src
*** get-task-property
#+begin_src emacs-lisp
(defun oldt-task-get-property (property)
  (when (org-clocking-p)
    (save-window-excursion
      (org-clock-goto)
      (if (string= property "STATE")
          (substring-no-properties (org-get-todo-state))
        (org-entry-get (mark) property t)))))
#+end_src
** Services
*** menu
#+begin_src emacs-lisp
(defun oldt-service-menu ()
  (interactive)
  (let ((tiny-menu-items
         `(("oldt-service"
            (,(oldt-service-get-property "ITEM")
             ((?d "Docker" oldt-docker-menu)
              (?r "Repo" oldt-browse-repo)
              (?c "CI" oldt-service-browse-ci)
              (?l "Logs" oldt-service-browse-logs)))))))
    (tiny-menu "oldt-service")))
#+end_src
*** get-service-property
#+begin_src emacs-lisp
(defun oldt-service-get-property (prop)
  (let ((service (split-string (oldt-project-get-property "SERVICES"))))
    (setq service (if (> (length service) 1)
                      (org-completing-read "Service: " service)
                    (car service)))
    (save-window-excursion
      (save-excursion
        (org-id-goto service)
        (alist-get prop (org-entry-properties) nil nil #'string=)))))
#+end_src
