org-literate-devtools.org
** send-current-to-remote
#+begin_src emacs-lisp
(defun oldt-send-current-to-remote ()
  (interactive)
  (when (and (boundp 'oldt-source-dir)
             (boundp 'oldt-target-dir))
    (copy-file (buffer-file-name)
               (s-replace oldt-source-dir oldt-target-dir (buffer-file-name))
               t)))

(add-hook 'after-save-hook 'oldt-send-current-to-remote)
#+end_src
** tests or something
#+begin_src emacs-lisp
(defun oldt-evaluate-blocks-current-heading ()
  (org-back-to-heading)
  (save-excursion
    (save-restriction
      (org-save-outline-visibility nil
        (narrow-to-region (org-entry-beginning-position) (org-entry-end-position))
        (loop while (condition-case-unless-debug user-error (org-babel-next-src-block) (user-error nil))
              collect (org-babel-execute-src-block nil nil '((:results . "silent"))) into report
              finally (return (-all-p (lambda (result) (s-contains-p "success" (downcase result))) report)))))))

(defun oldt-heading-sbe ()
  (interactive)
  (ledna/set-todo-state "LOADING")
  (sit-for 0.2)
  (if (oldt-evaluate-blocks-current-heading)
      (ledna/set-todo-state "PASSED")
    (ledna/set-todo-state "FAILED")))

(defun oldt-reset-tests ()
  (interactive)
  (ledna/set-todo-state "TEST" (ledna/search ":oldt:test_case:" 'tree))
  (org-update-statistics-cookies t))
#+end_src
* Provision

#+begin_src emacs-lisp
(provide 'org-literate-devtools)
;;; org-literate-devtools.el ends here
#+end_src

* Settings
# Local Variables:
# org-literate-test-selector: "^oldt-test-*"
# org-literate-test-buffer: "*oldt-tests*"
# org-use-tag-inheritance: t
# org-source-preserve-indentation: t
# org-adapt-indentation: nil
# indent-tabs-mode: nil
# End:
